# Data Mining Project
by Obsa Aba-waji Mirnary Carbajal

## Import Libs and Data

In [2]:
import pandas as pd
import numpy as np

In [14]:
emissions = pd.read_csv('emissions.csv')
vehicles = pd.read_csv('vehicles.csv', dtype=object)
data1 = pd.read_csv('CUUR0000SETB01.csv')
data2 = pd.read_csv('GASALLCOVW.csv')

# Check to see that Data has been loaded

Looking at the heaad of the data to make sure that the data has been loaded into their dataframes.

In [15]:
data1.head()

         DATE CUUR0000SETB01
0  1935-03-01         13.200
1  1935-04-01              .
2  1935-05-01              .
3  1935-06-01              .
4  1935-07-01         13.500

In [16]:
data2.head()

         DATE  GASALLCOVW
0  1994-11-28       1.175
1  1994-12-05       1.143
2  1994-12-12       1.118
3  1994-12-19       1.099
4  1994-12-26       1.088

In [11]:
emissions.head()

,efid,id,salesArea,score,scoreAlt,smartwayScore,standard,stdText
0,4HNXV03.2MJE,19332,3,1.0,-1.0,-1,B9,BIN 9
1,4HNXV03.2MJE,19332,7,1.0,-1.0,-1,L1,LEV
2,4HNXV03.2MJE,19333,3,1.0,-1.0,-1,B9,BIN 9
3,4HNXV03.2MJE,19333,7,1.0,-1.0,-1,L1,LEV
4,4ADXV01.8346,19334,3,1.0,-1.0,-1,B9,BIN 9

In [10]:
vehicles.head()

,barrels08,barrelsA08,charge120,charge240,city08,city08U,cityA08,cityA08U,cityCD,cityE,...,mfrCode,c240Dscr,charge240b,c240bDscr,createdOn,modifiedOn,startStop,phevCity,phevHwy,phevComb
0,15.695714285714287,0.0,0.0,0.0,19,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
1,29.96454545454546,0.0,0.0,0.0,9,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
2,12.207777777777778,0.0,0.0,0.0,23,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
3,29.96454545454546,0.0,0.0,0.0,10,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
4,17.347894736842107,0.0,0.0,0.0,17,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0

## Cleaning up data1

Cleaning up data1, because it has a lot of fields empty.